packages/StoveOpt/StoveOpt-0.3.10.tar.gz/StoveOpt-0.3.10/StoveOpt/foamfiles/counterFlowFlame2D/template_case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    fuel
    {
        type            zeroGradient;
    }
    outlet
    {
        type            totalPressure;
        p0              $internalField;
    }
	primary_air
	{
		type			zeroGradient;
	}
	Secondary_air_RHS 
	{
		type			zeroGradient;
	}	
	Secondary_air_LHS
	{
		type			zeroGradient;
	}
	stove_body
	{
		type			zeroGradient;
	}
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
